---
kind: type
id: T:Autodesk.Revit.DB.MaterialFunctionAssignment
source: html/1cbeb006-f7a2-f6d2-491f-faa0b9a006fc.htm
---
# Autodesk.Revit.DB.MaterialFunctionAssignment

Used in class CompoundStructure to specify the function of a layer.

## Syntax (C#)
```csharp
public enum MaterialFunctionAssignment
```

## Remarks
The function is used primarily to determine
 layer priority which affects how layers of distinct elements interact at a join. Typically, layers penetrate
 lower priority layers and merge with layers of the same priority.